#include "DxLib.h"

int WINAPI WinMain(HINSTANCE,HINSTANCE,LPSTR,int){
	//-----------------------------------------------------------------------------------------------------------
		ChangeWindowMode(TRUE); // ウィンドウモードに設定、FALSEなら、全画面

	//-----------------------------------------------------------------------------------------------------------
		DxLib_Init();   // DXライブラリ初期化処理
		
	//-----------------------------------------------------------------------------------------------------------
		// LoadGraphScreen( 50, 100, "画像/キャラクタ00.png", TRUE ); // 画像を描画する、ディスクからロード

		int Handle;     // データハンドル格納用変数
		Handle = LoadGraph( "画像/キャラクタ00.png" ); // 画像をロード
		DrawGraph( 50, 100, Handle, TRUE ); // データハンドルを使って画像を描画

		
	//-----------------------------------------------------------------------------------------------------------
		// WaitKey();      // キー入力待ち
		while( 1 ){
				// ProcessMessage();  //これがなければ、ほかのプログラムが通信できなくなる
			// ウィンドウの×ボタンが押されると ProcessMessage関数 が0以外を返すので、
			if( ProcessMessage() != 0 ){
						break;
				}
			// if( CheckHitKey(KEY_INPUT_ESCAPE) == 1 ) break;
		}

	//-----------------------------------------------------------------------------------------------------------
		DxLib_End();    // DXライブラリ終了処理
		return 0;
}